HalloYang06/PSOC_E84_robot/firmware/m55/libraries/Common/board/ports/lvgl/lv_port_indev.c
/*******************************************************************************
* File Name        : lv_port_indev.c
*
* Description      : This file provides implementation of low level input device
*                    driver for LVGL.
*
* Related Document : See README.md
*
******************************************************************************/

/*******************************************************************************
* Header Files
*******************************************************************************/
#include "lv_port_indev.h"
#include "cy_utils.h"
#include "drv_touch.h"
#include "cybsp.h"
#include <rtthread.h>

/*******************************************************************************
* Global Variables
*******************************************************************************/
lv_indev_t *indev_touchpad;
static rt_bool_t g_touchpad_ready = RT_FALSE;

/*******************************************************************************
* Function Name: touchpad_init
********************************************************************************
* Summary:
*  Initialization function for touchpad supported by LittelvGL.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
static rt_bool_t touchpad_init(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    if (rt_hw_ST7102_port() != result)
    {
        rt_kprintf("[lvgl_indev] ST7102 touch init failed, LVGL will start without touch\n");
        return RT_FALSE;
    }

    rt_kprintf("[lvgl_indev] ST7102 touch init ok\n");
    return RT_TRUE;
}


/*******************************************************************************
* Function Name: touchpad_read
********************************************************************************
* Summary:
*  Touchpad read function called by the LVGL library.
*  Here you will find example implementation of input devices supported by
*  LittelvGL:
*   - Touchpad
*   - Mouse (with cursor support)
*   - Keypad (supports GUI usage only with key)
*   - Encoder (supports GUI usage only with: left, right, push)
*   - Button (external buttons to press points on the screen)
*
*   The `..._read()` function are only examples.
*   You should shape them according to your hardware.
*
*
* Parameters:
*  *indev_drv: Pointer to the input driver structure to be registered by HAL.
*  *data: Pointer to the data buffer holding touch coordinates.
*
* Return:
*  void
*
*******************************************************************************/
static void touchpad_read(lv_indev_t *indev_drv, lv_indev_data_t *data)
{
    static rt_int16_t touch_x = 0;
    static rt_int16_t touch_y = 0;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    CY_UNUSED_PARAMETER(indev_drv);
    data->state = LV_INDEV_STATE_REL;

    if (!g_touchpad_ready)
    {
        data->point.x = touch_x;
        data->point.y = touch_y;
        return;
    }

    result = ST7102_get_single_touch(&touch_x, &touch_y);
    if (CY_RSLT_SUCCESS == result)
    {
        data->state = LV_INDEV_STATE_PR;
    }
    /* Set the last pressed coordinates */
    data->point.x = touch_x;
    data->point.y = touch_y;
}


/*******************************************************************************
* Function Name: lv_port_indev_init
********************************************************************************
* Summary:
*  Initialization function for input devices supported by LittelvGL.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void lv_port_indev_init(void)
{
    /* Initialize your touchpad if you have. */
    g_touchpad_ready = touchpad_init();
    if (!g_touchpad_ready)
    {
        return;
    }

    /* Register a touchpad input device */
    lv_indev_t *indev = lv_indev_create();
    lv_indev_set_type(indev, LV_INDEV_TYPE_POINTER);
    lv_indev_set_read_cb(indev, touchpad_read);
}


/* [] END OF FILE */
